[
  {
    "name": "Identity Provider",
    "date": "August 2017 - Present",
    "technology": "AWS, ASP.NET Core, Identity Server 4, C#, PostgreSQL",
    "summary": "Aims to unify the company's authentication and authorization data with a set of web APIs and supporting infrastructure that authenticates users and systems using tokens.",
    "contributions": [
      "Implemented from scratch using the latest ASP.NET Core using the OpenID Connect Certified IdentityServer4 framework",
      "Achieved a high-availability architecture through AWS technologies: Elastic Beanstalk, RDS, Application ELB for multiple running instances and with MultiAZ, Rolling/Canary updates, Blue-Green deployments and a failover region",
      "On-boarded several clients from the company including SPAs, WebApps, and protected API resources",
      "Added SAML support and integrated with external federation services, such as customers' ADFS identity servers",
      "Worked on the continuous integration and continuous deployment pipeline"
    ]
  },
  {
    "name": "Fleet Monitoring System",
    "date": "October 2011 - Present",
    "technology": "AWS, ASP.NET Framework, SQL Server, Kafka",
    "summary": "Websites and APIs companion to the Remote Presence telehealth devices, custom-designed to support an administrator's fleet management and monitoring workflow.",
    "contributions": [
      "Implemented a publisher for pushing messages to Kafka servers",
      "Integrated the FMS with Auth0 and Salesforce APIs",
      "Refactored components of the monolithic system into new independent cloud services",
      "Worked on a synchronization module for distributed SIP servers",
      "Redesigned the database model, and refactored code to modern C# standards",
      "Migrated in-house servers to Windows Server 2019 and Amazon Web Services cloud",
      "Migrated of the code base from centralized Perforce VCS to GitHub",
      "Lead an agile Scrum team that transitioned into Kanban with modern extreme programming techniques"
    ]
  },
  {
    "name": "Independent Projects",
    "date": "Present",
    "technology": "Blazor WebAssembly, GitHub Pages, GitHub Actions, Google Domains",
    "summary": "I am a technology enthusiast, this Single Page Application is just an example!",
    "contributions": [
      "I love improving my skills on my own free time reading technical books and doing courses",
      "Working prototypes: \"To learn and not to do is really not to learn. To know and not to do is really not to know.\" -Stephen R. Covey ",
      "Attend conferences in person or virtually to learn from others and stay up-to-date with upcoming technologies"
    ]
  }
]