[
  {
    "title": "Lead Software Architect",
    "company": "Teladoc Health",
    "date": "October 2020 - Present",
    "summary": "Interacting with stakeholders and product managers to identify business requirements. Document, communicate, and provide complete technical support of various projects for a big team of engineers, throughout their development cycle. Current focus is to migrate parts of a monolithic system into a microservices architecture, and collaborating with other parties towards FedRAMP compliance."
  },
  {
    "title": "Engineering Team Lead",
    "company": "InTouch Health",
    "date": "September 2017 - September 2020",
    "summary": "Managing a small team of software engineers with responsibilities over several full-stack projects, technologies and designs. Developing an Identity Provider server, an Authorization Provider, and a set of web APIs for a device’s Fleet Monitoring System, all hosted with high-availability on AWS."
  },
  {
    "title": "Software Engineer",
    "company": "InTouch Health",
    "date": "February 2014 - August 2017",
    "summary": "As a member of a scrum team designing, developing and maintaining a collection of systems consisting of a set of web applications, Windows services, and REST web services to monitor and administer the company's telehealth devices fleet."
  },
  {
    "title": "Software QA Engineer",
    "company": "InTouch Health",
    "date": "October 2011 - January 2014",
    "summary": "Performing tests on web-based applications and validating their functionality before they reached the customers. Proposing and working on the first automation project for some of the extensive suite of test cases."
  },
  {
    "title": "IT, Technical Services",
    "company": "InTouch Health",
    "date": "December 2009 - September 2011",
    "summary": "As a part of the Technical Support team assisting physicians and solving all kinds of problems over the phone. Additionally, performing server’s maintenance tasks, creating automated scripts for recurrent tasks, and training new members of the team on new systems or procedures."
  }
]